clear all;clc
Lena=imread('lena.bmp');
Rlena=rgb2gray(Lena);
f=tofloat(Rlena);
%转化RGB to LMS
lms=[ 0.3811 0.5783 0.0402
0.1967 0.7244 0.0782
0.0241 0.1288 0.8444];
L=0.3811.*Lena(:,:,1);+0.5783.*Lena(:,:,2)+0.0402*Lena(:,:,3);
M=0.1967.*Lena(:,:,1)+0.7244.*Lena(:,:,2)+0.0782.*Lena(:,:,3);
S=0.0241.*Lena(:,:,1)+0.1288.*Lena(:,:,2)+0.8444.*Lena(:,:,3);
LMS(:,:,1)=L;
LMS(:,:,2)=M;
LMS(:,:,3)=S;
%LMS 的彩色空间分量L、M、S转化为彩色色调函数分量分量
l_ms=255-LMS;
a=1-(im2double(L)).^(40/61).*(im2double(M)).^(20/61).*(im2double(S)).^(1/61);
r=1-(im2double(L)).^1.*(im2double(M)).^(-12/11).*(im2double(S)).^(1/11);
y=1-(im2double(L)).^(1/9).*(im2double(M)).^(1/9).*(im2double(S)).^(-2/9);
% 减少把多余的彩色分量
a_=-300/255*log(1.2)*abs(1-255*a/300);
r_=-300/255*log(1.2)*abs(1-255*r/300);
y_=-300/255*log(1.2)*abs(1-255*y/300);
%将其变换回LMS
[x,y,z]=solve('1-(x)^(40/61)*(y)^(20/61)*(z)^(1/61)=a','1-(x)^1*(y)^(-12/11)*(z)^(1/11)=r','1-(x)^(1/9)*(y)^(1/9)*(z)^(-2/9)=m');



